projectFiles/straightPipe/Re20000/q-1000/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-0.5     -1.2        0)      //0
    (0      -1.2        0)      //1
    (0      -1.0        0)      //2
    (-0.5     -1.0        0)      //3
    (-0.5     -1.2        0.01)   //4
    (0      -1.2        0.01)   //5
    (0      -1.0        0.01)   //6
    (-0.5     -1.0        0.01)   //7

    (-0.5      1.0        0)      //8
    (0       1.0        0)      //9
    (0       1.2        0)      //10
    (-0.5      1.2        0)      //11
    (-0.5      1.0        0.01)   //12
    (0       1.0        0.01)   //13
    (0       1.2        0.01)   //14
    (-0.5      1.2        0.01)   //15

    (1.2     0.0        0)      //16
    (1.0     0.0        0)      //17
    (1.2     0.0        0.01)   //18
    (1.0     0.0        0.01)   //19
);

blocks
(
    hex (0 1 2 3 4 5 6 7)   (50 20 1) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15) (50 20 1) simpleGrading (1 1 1)
    hex (17 16 10 9 19 18 14 13) (20 160 1) simpleGrading (1 1 1)
    hex (2 1 16 17 6 5 18 19) (20 160 1) simpleGrading (1 1 1)
);

edges
(
    arc 13 19 (0.707 0.707 0.01)
    arc 14 18 (0.849 0.849 0.01)
    arc 09 17 (0.707 0.707 0)
    arc 10 16 (0.849 0.849 0)

    arc 06 19 (0.707 -0.707 0.01)
    arc 05 18 (0.849 -0.849 0.01)
    arc 02 17 (0.707 -0.707 0)
    arc 01 16 (0.849 -0.849 0)
);

boundary
(
    wall
    {
        type wall;
        faces
        (
            (12 13 14 15)
            (8 9 10 11)
            (0 1 2 3)
            (4 5 6 7)
            (13 19 18 14)
            (17 16 10 9)
            (1 16 17 2)
            (5 18 19 6)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (12 15 11 8)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (7 3 0 4)
        );
    }
    heatWall
    {
        type wall;
        faces
        (
            (15 14 10 11)
	    (14 18 16 10)
	    (5 18 16 1)
            (4 5 1 0)
            (13 19 17 9)
	    (12 13 9 8)
            (7 6 2 3)
            (6 19 17 2)
        );
    }
);


// ************************************************************************* //